player={
    'name':'',
    'armor':0.95,
    'hp':100,
    'attack':5,
    'luck':10,
    'money':99999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999,
    'inventory':[],
}

enemies=[
    {
        'name':'iван Zоло',
        'hp':25,
        'attack':5,
        'script':'Абоюдна тыщ тыщ тыщ',
        'win':'АбоюдненькоГыГЫГЫ',
        'loss':'туда бомжа EzEz',
    },
   {
    'name': 'Батя Ивана Золо',
    'hp':100,
    'attack': 1,
    'script': 'Кидаю в Ваню бутылку',
    'win': '12 тысяч дамага на амонавцэ',
    'loss': 'Туда нуба Ez',
   },
   {
    'name': 'Бiрiбiлька',
    'hp':15,
    'attack': 3,
    'script': 'Перевожу бабулек через дорогу',
    'win': 'Плака плака',
    'loss': 'EzEzEz', 
   },
   {'name': 'Яйцефонк',
    'hp':25,
    'attack': 7,
    'script': '42 братуха Кемерово',
    'win': 'плаки плаки щавiль',
    'loss': 'Плака плака щавэль42424242',
    },
    {
        'name': 'Мистер 5орка',
    'hp': 50,
    'attack': 5,
    'script': '42 братуха',
    'win': 'стари бох лучше(((((',
    'loss': 'Не трогаю монеты',
    },
    {
        'name': 'Мге паровозик',
    'hp':99999,
    'attack': 9999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999999,
    'script': 'Не зли мге братьев в 3 часа ночи',
    'win': 'Паровозик уезжает',
    'loss': 'Попался сосунок!',
    },
]

items={
    '1':{'name': 'Зелье удачи', 'price':1500 },
    '2':{'name': 'Пропуск тренеровки', 'price':99999 },

}
chances=[0.2, 0.3, 0.2, 0.199, 0.1, 0.001]
print(sum(chances))
distribution=[0.2, 0.5, 0.7, 0.899, 0.999, 1]
